Revit 2027 API
View.AreGraphicsOverridesAllowed Method
 Determines if Visibility/Graphics Overriddes can be applied to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreGraphicsOverridesAllowed()
Public Function AreGraphicsOverridesAllowed As Boolean
public:
bool AreGraphicsOverridesAllowed()
member AreGraphicsOverridesAllowed : unit -> bool
Return Value
Boolean
 True if Overriddes can be applied to the view, false otherwise.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace